rpcme/aws-mikroe-smarthome-pic32mz/smarthome-kit/microchip/harmony/v2.05/framework/peripheral/eth/processor/eth_p32mz2048efh124.h
PLIB_INLINE_API bool PLIB_ETH_MIIResetIsEnabled(ETH_MODULE_ID index)
{
     return ETH_MIIResetIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_SimResetEnable(ETH_MODULE_ID index)
{
     ETH_SimResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_SimResetDisable(ETH_MODULE_ID index)
{
     ETH_SimResetDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_SimResetIsEnabled(ETH_MODULE_ID index)
{
     return ETH_SimResetIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MCSRxResetEnable(ETH_MODULE_ID index)
{
     ETH_MCSRxResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MCSRxResetDisable(ETH_MODULE_ID index)
{
     ETH_MCSRxResetDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_MCSRxResetIsEnabled(ETH_MODULE_ID index)
{
     return ETH_MCSRxResetIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxFuncResetEnable(ETH_MODULE_ID index)
{
     ETH_RxFuncResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxFuncResetDisable(ETH_MODULE_ID index)
{
     ETH_RxFuncResetDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_RxFuncResetIsEnabled(ETH_MODULE_ID index)
{
     return ETH_RxFuncResetIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MCSTxResetEnable(ETH_MODULE_ID index)
{
     ETH_MCSTxResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MCSTxResetDisable(ETH_MODULE_ID index)
{
     ETH_MCSTxResetDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_MCSTxResetIsEnabled(ETH_MODULE_ID index)
{
     return ETH_MCSTxResetIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TxFuncResetEnable(ETH_MODULE_ID index)
{
     ETH_TxFuncResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TxFuncResetDisable(ETH_MODULE_ID index)
{
     ETH_TxFuncResetDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_TxFuncResetIsEnabled(ETH_MODULE_ID index)
{
     return ETH_TxFuncResetIsEnabled_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsMAC_Resets(ETH_MODULE_ID index)
{
     return ETH_ExistsMAC_Resets_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_LoopbackEnable(ETH_MODULE_ID index)
{
     ETH_LoopbackEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_LoopbackDisable(ETH_MODULE_ID index)
{
     ETH_LoopbackDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_LoopbackIsEnabled(ETH_MODULE_ID index)
{
     return ETH_LoopbackIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TxPauseEnable(ETH_MODULE_ID index)
{
     ETH_TxPauseEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_TxPauseDisable(ETH_MODULE_ID index)
{
     ETH_TxPauseDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_TxPauseIsEnabled(ETH_MODULE_ID index)
{
     return ETH_TxPauseIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxPauseEnable(ETH_MODULE_ID index)
{
     ETH_RxPauseEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxPauseDisable(ETH_MODULE_ID index)
{
     ETH_RxPauseDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_RxPauseIsEnabled(ETH_MODULE_ID index)
{
     return ETH_RxPauseIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_PassAllEnable(ETH_MODULE_ID index)
{
     ETH_PassAllEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_PassAllDisable(ETH_MODULE_ID index)
{
     ETH_PassAllDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_PassAllIsEnabled(ETH_MODULE_ID index)
{
     return ETH_PassAllIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ReceiveEnable(ETH_MODULE_ID index)
{
     ETH_ReceiveEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ReceiveDisable(ETH_MODULE_ID index)
{
     ETH_ReceiveDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ReceiveIsEnabled(ETH_MODULE_ID index)
{
     return ETH_ReceiveIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ExcessDeferEnable(ETH_MODULE_ID index)
{
     ETH_ExcessDeferEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_ExcessDeferDisable(ETH_MODULE_ID index)
{
     ETH_ExcessDeferDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExcessDeferIsEnabled(ETH_MODULE_ID index)
{
     return ETH_ExcessDeferIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_BackPresNoBackoffEnable(ETH_MODULE_ID index)
{
     ETH_BackPresNoBackoffEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_BackPresNoBackoffDisable(ETH_MODULE_ID index)
{
     ETH_BackPresNoBackoffDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_BackPresNoBackoffIsEnabled(ETH_MODULE_ID index)
{
     return ETH_BackPresNoBackoffIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_NoBackoffEnable(ETH_MODULE_ID index)
{
     ETH_NoBackoffEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_NoBackoffDisable(ETH_MODULE_ID index)
{
     ETH_NoBackoffDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_NoBackoffIsEnabled(ETH_MODULE_ID index)
{
     return ETH_NoBackoffIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_LongPreambleEnable(ETH_MODULE_ID index)
{
     ETH_LongPreambleEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_LongPreambleDisable(ETH_MODULE_ID index)
{
     ETH_LongPreambleDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_LongPreambleIsEnabled(ETH_MODULE_ID index)
{
     return ETH_LongPreambleIsEnabled_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_PurePreambleEnable(ETH_MODULE_ID index)
{
     ETH_PurePreambleEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_PurePreambleDisable(ETH_MODULE_ID index)
{
     ETH_PurePreambleDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_PurePreambleIsEnabled(ETH_MODULE_ID index)
{
     return ETH_PurePreambleIsEnabled_Default(index);
}

PLIB_INLINE_API ETH_AUTOPAD_OPTION PLIB_ETH_AutoDetectPadGet(ETH_MODULE_ID index)
{
     return ETH_AutoDetectPadGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_AutoDetectPadSet(ETH_MODULE_ID index, ETH_AUTOPAD_OPTION option)
{
     ETH_AutoDetectPadSet_Default(index, option);
}

PLIB_INLINE_API void PLIB_ETH_AutoDetectPadClear(ETH_MODULE_ID index, ETH_AUTOPAD_OPTION option)
{
     ETH_AutoDetectPadClear_Default(index, option);
}

PLIB_INLINE_API void PLIB_ETH_CRCEnable(ETH_MODULE_ID index)
{
     ETH_CRCEnable_Default(index);
}

